ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bas.c
/***************************************************************************//**
* \file cy_ble_bas.c
* \version 2.0
*
* \brief
*  Contains the source code for the Battery Service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_BAS))

static cy_ble_callback_t Cy_BLE_BAS_ApplCallback = NULL;

#ifdef CY_BLE_BAS_CLIENT
/* BAS Center Service characteristics GATT DB handles structure */
cy_stc_ble_basc_t cy_ble_basc[CY_BLE_CONFIG_GATTC_COUNT][CY_BLE_BASC_SERVICE_COUNT];

/* The internal storage for the last request handle to check response */
static cy_ble_gatt_db_attr_handle_t cy_ble_bascReqHandle[CY_BLE_CONFIG_GATTC_COUNT];
#endif /* (CY_BLE_BAS_CLIENT) */

/* The pointer to the global BLE BAS config structure */
cy_stc_ble_bas_config_t *cy_ble_basConfigPtr = NULL;

/***************************************
* Private Function Prototypes
***************************************/
#ifdef CY_BLE_BAS_SERVER
static cy_en_ble_gatt_err_code_t Cy_BLE_BASS_WriteEventHandler(
    const cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
#endif /* CY_BLE_BAS_SERVER */

#ifdef CY_BLE_BAS_CLIENT
static void Cy_BLE_BASC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_BASC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_BASC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_BASC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam);
static void Cy_BLE_BASC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_BASC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_BASC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
#endif /* (CY_BLE_BAS_CLIENT) */
static cy_en_ble_gatt_err_code_t Cy_BLE_BAS_EventHandler(uint32_t eventCode, void *eventParam);


/******************************************************************************
* Function Name: Cy_BLE_BAS_Init
***************************************************************************//**
*
*  This function initializes the BAS Service.
*
*  \param config: The configuration structure for the BAS Service.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER          | On specifying NULL as input parameter
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED   | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BAS_Init(cy_stc_ble_bas_config_t *config)
{
    cy_en_ble_api_result_t apiResult;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Registers a pointer to config structure */
        cy_ble_basConfigPtr = config;

        /* Registers Event Handler for the BAS Service */
        apiResult = Cy_BLE_RegisterServiceEventHandler(&Cy_BLE_BAS_EventHandler);

        /* Registers a callback function via config structure */
        if(cy_ble_basConfigPtr->callbackFunc != NULL)
        {
            Cy_BLE_BAS_ApplCallback = cy_ble_basConfigPtr->callbackFunc;
        }

    #ifdef CY_BLE_BAS_CLIENT
        {
            uint32_t idx;
            uint8_t locServIndex;
            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                for(locServIndex = 0u; locServIndex < (uint32_t)CY_BLE_BASC_SERVICE_COUNT; locServIndex++)
                {
                    if(cy_ble_serverInfo[idx][CY_BLE_SRVI_BAS + locServIndex].range.startHandle ==
                       CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                    {
                        (void)memset(&cy_ble_basc[idx][locServIndex], 0, sizeof(cy_stc_ble_basc_t));

                        /* Initialize uuid  */
                        cy_ble_serverInfo[idx][CY_BLE_SRVI_BAS + locServIndex].uuid = CY_BLE_UUID_BAS_SERVICE;
                    }
                }
                cy_ble_bascReqHandle[idx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
        }
    #endif /* CY_BLE_BAS_CLIENT */
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_BAS_RegisterAttrCallback
***************************************************************************//**
*
*  Registers a callback function for service-specific attribute operations.
*  Service specific Write requests from the peer device will not be handled with
*  an unregistered callback function.
*
*  \param callbackFunc: An application layer event callback function to receive
*                    Battery Service events from the BLE Component. The
*                    definition of cy_ble_callback_t for Battery Service is,\n
*                    typedef void (* cy_ble_callback_t) (uint32_t eventCode,
*                                                         void *eventParam)
*                    * eventCode indicates the event that triggered this
*                       callback (e.g. CY_BLE_EVT_BASS_NOTIFICATION_ENABLED)
*                    * eventParam contains the parameters corresponding to the
*                       current event (e.g., the pointer to the cy_stc_ble_bas_char_value_t
*                       structure that contains details of the characteristic
*                       for which a notification enabled event was triggered)
*
* \sideeffect The *eventParams in the callback function should not be used
*                by the application when the callback function execution is
*                finished. Otherwise, this data may become corrupted.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes:
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_OPERATION          | This operation is not permitted
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BAS_RegisterAttrCallback(cy_ble_callback_t callbackFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    
    Cy_BLE_BAS_ApplCallback = callbackFunc;
    if(cy_ble_basConfigPtr != NULL)
    {
        cy_ble_basConfigPtr->callbackFunc = callbackFunc;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    
    return(apiResult);
}


#ifdef CY_BLE_BAS_SERVER


