ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bas.c
/******************************************************************************
* Function Name: Cy_BLE_BASS_SetCharacteristicValue
***************************************************************************//**
*
*  Sets a characteristic value of the service in the local database.
*
*  \param serviceIndex: The index of the service instance.
*  \param charIndex: The index of the service characteristic of type
*              cy_en_ble_bas_char_index_t.
*  \param attrSize: The size of the characteristic value attribute. A battery level
*             characteristic has a 1-byte length.
*  \param attrValue: The pointer to the characteristic value data that should be
*               stored to the GATT database.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BASS_SetCharacteristicValue(uint8_t serviceIndex,
                                                          cy_en_ble_bas_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

    if((serviceIndex >= CY_BLE_BASS_SERVICE_COUNT) || (charIndex >= CY_BLE_BAS_CHAR_COUNT) ||
       (attrSize != CY_BLE_BAS_BATTERY_LEVEL_LEN) || (*attrValue > CY_BLE_BAS_MAX_BATTERY_LEVEL_VALUE))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Store data in the database */
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair.attrHandle = cy_ble_basConfigPtr->bass[serviceIndex].batteryLevelHandle,
            .handleValuePair.value.len  = attrSize,
            .handleValuePair.value.val  = attrValue,
            .offset                     = 0u,
            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
        };

        if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
        {
            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_BASS_GetCharacteristicValue
***************************************************************************//**
*
*  Gets a characteristic value of the Battery Service, identified by charIndex.
*
*  \param serviceIndex: The index of the service instance. e.g. if two Battery Services
*                 are supported in your design, then the first service will be
*                 identified by serviceIndex of 0 and the second service - by serviceIndex
*                 of 1.
*  \param charIndex: The index of a service characteristic of type cy_en_ble_bas_char_index_t.
*  \param attrSize: The size of the characteristic value attribute. A battery level
*             characteristic has a 1-byte length.
*  \param attrValue: The pointer to the location where characteristic value data
*               should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BASS_GetCharacteristicValue(uint8_t serviceIndex,
                                                          cy_en_ble_bas_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

    if((serviceIndex >= CY_BLE_BASS_SERVICE_COUNT) || (charIndex >= CY_BLE_BAS_CHAR_COUNT) ||
       (attrSize != CY_BLE_BAS_BATTERY_LEVEL_LEN))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Read characteristic value from database */
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair.attrHandle = cy_ble_basConfigPtr->bass[serviceIndex].batteryLevelHandle,
            .handleValuePair.value.len  = attrSize,
            .handleValuePair.value.val  = attrValue,
            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
        };

        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
        {
            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_BASS_GetCharacteristicDescriptor
***************************************************************************//**
*
*  Gets a characteristic descriptor of a specified characteristic of the
*   Battery Service from the local GATT database.
*
*  \param connHandle: The BLE peer device connection handle.
*  \param serviceIndex: The index of the service instance. e.g. If two Battery Services
*                 are supported in your design, then the first service will be
*                 identified by serviceIndex of 0 and the second service - by serviceIndex
*                 of 1.
*  \param charIndex: The index of a service characteristic of type
*              cy_en_ble_bas_char_index_t.
*  \param descrIndex: The index of a service characteristic descriptor of type
*               cy_en_ble_bas_descr_index_t.
*  \param attrSize: The size of the characteristic descriptor attribute.
*  \param attrValue: The pointer to the location where the characteristic descriptor
*               value data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BASS_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               uint8_t serviceIndex,
                                                               cy_en_ble_bas_char_index_t charIndex,
                                                               cy_en_ble_bas_descr_index_t descrIndex,
                                                               uint8_t attrSize,
                                                               uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

    if((serviceIndex >= CY_BLE_BASS_SERVICE_COUNT) || (charIndex >= CY_BLE_BAS_CHAR_COUNT) ||
       (descrIndex >= CY_BLE_BAS_DESCR_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair.value.len = attrSize,
            .handleValuePair.value.val = attrValue,
            .connHandle                = connHandle,
            .flags                     = CY_BLE_GATT_DB_LOCALLY_INITIATED,
        };

        /* Get data from the database */
        if(descrIndex == CY_BLE_BAS_BATTERY_LEVEL_CCCD)
        {
            dbAttrValInfo.handleValuePair.attrHandle = cy_ble_basConfigPtr->bass[serviceIndex].cccdHandle;
        }
        else
        {
            dbAttrValInfo.handleValuePair.attrHandle = cy_ble_basConfigPtr->bass[serviceIndex].cpfdHandle;
        }

        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
        {
            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
        }
    }

    return(apiResult);
}


