ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bas.c
/******************************************************************************
* Function Name: Cy_BLE_BASS_WriteEventHandler
***************************************************************************//**
*
*  Handles a Write Request Event for the Battery Service.
*
*  \param void *eventParam: The pointer to the data structure specified by the event.
*
* \return
*  Return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - A Write request is handled successfully.
*   * CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED - Notification isn't supported.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - An internal error while writing attribute
*                                      value.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_BASS_WriteEventHandler(const cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    uint8_t locServIndex = 0u;
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    cy_stc_ble_bas_char_value_t locCharIndex = { .connHandle = eventParam->connHandle };

    if(Cy_BLE_BAS_ApplCallback != NULL)
    {
        do
        {
            /* Client Characteristic Configuration descriptor Write request */
            if(eventParam->handleValPair.attrHandle == cy_ble_basConfigPtr->bass[locServIndex].cccdHandle)
            {
                /* Verify that the optional notification property is enabled for the Battery Level characteristic */
                if(CY_BLE_IS_NOTIFICATION_SUPPORTED(cy_ble_basConfigPtr->bass[locServIndex].batteryLevelHandle))
                {
                    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                    {
                        .handleValuePair = eventParam->handleValPair,
                        .connHandle      = eventParam->connHandle,
                        .offset          = 0u,
                        .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                    };

                    gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
                    if(gattErr == CY_BLE_GATT_ERR_NONE)
                    {
                        locCharIndex.serviceIndex = locServIndex;
                        locCharIndex.charIndex = CY_BLE_BAS_BATTERY_LEVEL;
                        locCharIndex.value = NULL;

                        if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                        {
                            Cy_BLE_BAS_ApplCallback((uint32_t)CY_BLE_EVT_BASS_NOTIFICATION_ENABLED, &locCharIndex);
                        }
                        else
                        {
                            Cy_BLE_BAS_ApplCallback((uint32_t)CY_BLE_EVT_BASS_NOTIFICATION_DISABLED, &locCharIndex);
                        }
                    #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                        (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))

                        /* Sets a flag to store bonding data to flash */
                        if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                        {
                            cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                        }
                    #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
                    }
                }
                else
                {
                    gattErr = CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED;
                }
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                break;
            }
            locServIndex++;
        }
        while(locServIndex < CY_BLE_BASS_SERVICE_COUNT);
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: Cy_BLE_BASS_SendNotification
***************************************************************************//**
*
*  This function updates the value of the Battery Level characteristic in the
*  GATT database. If the Client has configured a notification on the Battery
*  Level characteristic, the function additionally sends this value using a
*  GATT Notification message.
*
*  On enabling notification successfully for a service characteristic it sends out a
*  Handle Value notification which results in CY_BLE_EVT_BASC_NOTIFICATION event
*  at the GATT Client's end.
*
*  \param connHandle: The BLE peer device connection handle
*  \param serviceIndex: The index of the service instance. e.g. If two Battery Services
*                 are supported in your design, then the first service will be
*                 identified by serviceIndex of 0 and the second service - by
*                 serviceIndex of 1.
*  \param charIndex: The index of a service characteristic of type
*              cy_en_ble_bas_char_index_t.
*  \param attrSize: The size of the characteristic value attribute. A battery level
*             characteristic has a 1-byte length.
*  \param attrValue: The pointer to the characteristic value data that should be
*               sent to the Client device.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request handled successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed.
*   * CY_BLE_ERROR_INVALID_OPERATION - This operation is not permitted.
*   * CY_BLE_ERROR_INVALID_STATE - Connection with the client is not established.
*   * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*   * CY_BLE_ERROR_NTF_DISABLED - Notification is not enabled by the Client.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BASS_SendNotification(cy_stc_ble_conn_handle_t connHandle,
                                                    uint8_t serviceIndex,
                                                    cy_en_ble_bas_char_index_t charIndex,
                                                    uint8_t attrSize,
                                                    uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult;

    /* Store new data in the database */
    apiResult = Cy_BLE_BASS_SetCharacteristicValue(serviceIndex, charIndex, attrSize, attrValue);

    if(apiResult == CY_BLE_SUCCESS)
    {
        /* Send notification if it is enabled and connected */
        if(Cy_BLE_GetConnectionState(connHandle) < CY_BLE_CONN_STATE_CONNECTED)
        {
            apiResult = CY_BLE_ERROR_INVALID_STATE;
        }
        else if((cy_ble_basConfigPtr->bass[serviceIndex].cccdHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE) ||
                (!CY_BLE_IS_NOTIFICATION_ENABLED(connHandle.attId, cy_ble_basConfigPtr->bass[serviceIndex].cccdHandle)))
        {
            apiResult = CY_BLE_ERROR_NTF_DISABLED;
        }
        else
        {
            cy_stc_ble_gatts_handle_value_ntf_t ntfReqParam =
            {
                /* Fill all fields of the Write request structure ... */
                .handleValPair.attrHandle = cy_ble_basConfigPtr->bass[serviceIndex].batteryLevelHandle,
                .handleValPair.value.val  = attrValue,
                .handleValPair.value.len  = attrSize,
                .connHandle               = connHandle
            };

            /* Send notification to the Client using a previously filled structure */
            apiResult = Cy_BLE_GATTS_Notification(&ntfReqParam);
        }
    }

    return(apiResult);
}

