ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bas.c
#endif /* CY_BLE_BAS_SERVER */

#ifdef CY_BLE_BAS_CLIENT


/******************************************************************************
* Function Name: Cy_BLE_BASC_DiscoverCharacteristicsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP
*  event. Based on the service UUID, the appropriate data structure is populated
*  using the data received as part of the callback.
*
*  \param discCharInfo: The pointer to a characteristic information structure.
*
******************************************************************************/
static void Cy_BLE_BASC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discCharInfo->connHandle);

    if((discCharInfo->uuidFormat == CY_BLE_GATT_16_BIT_UUID_FORMAT) &&
       (discCharInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_BATTERY_LEVEL) &&
       (cy_ble_discovery[discIdx].servCount >= (uint32_t)CY_BLE_SRVI_BAS) &&
       (cy_ble_discovery[discIdx].servCount <= (uint32_t)CY_BLE_SRVI_BAS_END))
    {
        /* The index of the service instance */
        uint32_t basServIdx = cy_ble_discovery[discIdx].servCount - (uint32_t)CY_BLE_SRVI_BAS;

        /* Check and store characteristic handle */
        Cy_BLE_CheckStoreCharHandle(cy_ble_basc[discIdx][basServIdx].batteryLevel);

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BASC_DiscoverCharDescriptorsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_FIND_INFO_RSP event.
*  Based on the descriptor UUID, an appropriate data structure is populated
*  using the data received as part of the callback.
*
*  \param discDescrInfo: The pointer to a descriptor information structure.
*  \param discoveryService: The index of the service instance.
*
******************************************************************************/
static void Cy_BLE_BASC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discDescrInfo->connHandle);
    uint32_t basServIdx = cy_ble_discovery[discIdx].servCount - (uint32_t)CY_BLE_SRVI_BAS;

    if((cy_ble_discovery[discIdx].servCount >= (uint32_t)CY_BLE_SRVI_BAS) &&
       (cy_ble_discovery[discIdx].servCount <= (uint32_t)CY_BLE_SRVI_BAS_END))
    {
        if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_CLIENT_CONFIG)
        {
            Cy_BLE_CheckStoreCharDescrHandle(cy_ble_basc[discIdx][basServIdx].cccdHandle);
        }
        else if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_FORMAT)
        {
            Cy_BLE_CheckStoreCharDescrHandle(cy_ble_basc[discIdx][basServIdx].cpfdHandle);
        }
        else if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_REPORT_REFERENCE)
        {
            Cy_BLE_CheckStoreCharDescrHandle(cy_ble_basc[discIdx][basServIdx].rrdHandle);
        }
        else    /* BAS doesn't support other descriptors */
        {
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BASC_GetCharRange
***************************************************************************//**
*
* Returns a possible range of the current characteristic descriptor via
* input parameter charRangeInfo->range
*
* \param *charRangeInfo: The pointer to a descriptor range information structure.
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_BASC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(charRangeInfo->connHandle);

    if((cy_ble_discovery[discIdx].servCount >= (uint32_t)CY_BLE_SRVI_BAS) &&
       (cy_ble_discovery[discIdx].servCount <= (uint32_t)CY_BLE_SRVI_BAS_END))
    {
        /* The index of the service instance */
        uint32_t basServIdx = cy_ble_discovery[discIdx].servCount - (uint32_t)CY_BLE_SRVI_BAS;

        if(charRangeInfo->srviIncIdx != CY_BLE_DISCOVERY_INIT)
        {
            cy_ble_discovery[discIdx].charCount++;
        }

        if((cy_ble_discovery[discIdx].charCount == 0u) &&
           (cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.endHandle !=
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
        {
            charRangeInfo->range.startHandle = cy_ble_basc[discIdx][basServIdx].batteryLevel.valueHandle + 1u;
            charRangeInfo->range.endHandle = cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.endHandle;
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}

/******************************************************************************
* Function Name: Cy_BLE_BASC_GetCharacteristicValue
***************************************************************************//**
*
*  This function is used to read the characteristic value from the Server
*  identified by charIndex.
*
*  This function call can result in generation of the following events based on
*  a response from the Server device:
*  * CY_BLE_EVT_BASC_READ_CHAR_RESPONSE
*  * CY_BLE_EVT_GATTC_ERROR_RSP
*
*  \param connHandle: The BLE peer device connection handle.
*  \param serviceIndex: The index of the service instance. e.g. If two Battery Services are
*                 supported in your design, then the first service will be identified
*                 by serviceIndex of 0 and the second service - by serviceIndex of 1.
*  \param charIndex: The index of a service characteristic of type cy_en_ble_bas_char_index_t.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The Read request was sent successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - The peer device doesn't have
*                                              the particular characteristic.
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*  * CY_BLE_ERROR_INVALID_STATE - Connection with the Server is not established.
*  * CY_BLE_ERROR_INVALID_OPERATION - The operation is invalid for this
*                                    characteristic.
*
* \events
*  If execution is successful (return value = CY_BLE_SUCCESS)
*  these events can appear: \n
*   If the BAS service-specific callback is registered
*      (with Cy_BLE_BAS_RegisterAttrCallback):
*  * CY_BLE_EVT_BASC_READ_CHAR_RESPONSE - if the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index , value, etc.) are
*                                provided with an event parameter structure
*                                of type cy_stc_ble_bas_char_value_t.
*  .
*   Otherwise (if a BAS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_READ_RSP - if the requested attribute is
*                                successfully read on the peer device,
*                                the details (handle, value, etc.) are
*                                provided with the event parameters
*                                structure (cy_stc_ble_gattc_read_rsp_param_t).
*  * CY_BLE_EVT_GATTC_ERROR_RSP - if there is trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with the event parameters
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BASC_GetCharacteristicValue(cy_stc_ble_conn_handle_t connHandle,
                                                          uint8_t serviceIndex,
                                                          cy_en_ble_bas_char_index_t charIndex)
{
    cy_en_ble_api_result_t apiResult;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((serviceIndex >= (uint32_t)CY_BLE_BASC_SERVICE_COUNT) || (charIndex > CY_BLE_BAS_BATTERY_LEVEL) || 
            (discIdx >= CY_BLE_CONFIG_GATTC_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(cy_ble_basc[discIdx][serviceIndex].batteryLevel.valueHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
    {
        cy_stc_ble_gattc_read_req_t readReqParam =
        {
            .attrHandle = cy_ble_basc[discIdx][serviceIndex].batteryLevel.valueHandle,
            .connHandle = connHandle
        };

        apiResult = Cy_BLE_GATTC_ReadCharacteristicValue(&readReqParam);
        /* Save the handle to support service-specific Read response from the device */
        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_bascReqHandle[discIdx] = cy_ble_basc[discIdx][serviceIndex].batteryLevel.valueHandle;
        }
    }
    else
    {
        apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
    }

    return(apiResult);
}


