ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bas.c
/******************************************************************************
* Function Name: Cy_BLE_BASC_SetCharacteristicDescriptor
***************************************************************************//**
*
*  Sends a request to set a characteristic descriptor of the specified Battery Service
*  characteristic on the server device.
*
*  Internally, a Write Request is sent to the GATT Server and on successful
*  execution of the request on the Server's side the following events can be
*  generated:
*  * CY_BLE_EVT_BASS_NOTIFICATION_ENABLED
*  * CY_BLE_EVT_BASS_NOTIFICATION_DISABLED
*
*  \param connHandle: The BLE peer device connection handle.
*  \param serviceIndex: The index of the service instance. e.g. If two Battery Services
*                       are supported in your design, then the first service will be
*                       identified by serviceIndex of 0 and the second service - by
*                       serviceIndex of 1.
*  \param charIndex: The index of a service characteristic of type
*                    cy_en_ble_bas_char_index_t.
*  \param descrIndex: The index of a service characteristic descriptor of type
*                     cy_en_ble_bas_descr_index_t.
*  \param attrSize: The size of the characteristic descriptor attribute.
*  \param attrValue: The pointer to the characteristic descriptor value data that should
*                    be sent to the Server device.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request was sent successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*  * CY_BLE_ERROR_INVALID_STATE - The state is not valid.
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*  * CY_BLE_ERROR_INVALID_OPERATION - This operation is not permitted on
*                                     the specified attribute.
*
* \events
*  If execution is successful (return value = CY_BLE_SUCCESS),
*  these events can appear: \n
*   If a BAS service-specific callback is registered
*      (with Cy_BLE_BAS_RegisterAttrCallback):
*  * CY_BLE_EVT_BASC_WRITE_DESCR_RESPONSE - if the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index, descr index etc.) are
*                                provided with an event parameter structure
*                                of type cy_stc_ble_bas_descr_value_t.
*  .
*   Otherwise (if a BAS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_WRITE_RSP - if the requested attribute is
*                                successfully written on the peer device.
*  * CY_BLE_EVT_GATTC_ERROR_RSP - if there is trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with the event parameters
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BASC_SetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               uint8_t serviceIndex,
                                                               cy_en_ble_bas_char_index_t charIndex,
                                                               cy_en_ble_bas_descr_index_t descrIndex,
                                                               uint8_t attrSize,
                                                               uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((serviceIndex >= (uint32_t)CY_BLE_BASC_SERVICE_COUNT) || (charIndex > CY_BLE_BAS_BATTERY_LEVEL) ||
            (descrIndex >= CY_BLE_BAS_DESCR_COUNT) || (discIdx >= CY_BLE_CONFIG_GATTC_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(descrIndex != CY_BLE_BAS_BATTERY_LEVEL_CCCD)
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    else
    {
        /* Fill all the fields of the Write request structure ... */
        cy_stc_ble_gattc_write_req_t writeReqParam =
        {
            .handleValPair.attrHandle = cy_ble_basc[discIdx][serviceIndex].cccdHandle,
            .handleValPair.value.val  = attrValue,
            .handleValPair.value.len  = attrSize,
            .connHandle               = connHandle
        };

        /* ... and send a request to the Server device. */
        apiResult = Cy_BLE_GATTC_WriteCharacteristicDescriptors(&writeReqParam);

        /* Save the handle to support service-specific Read response from the device */
        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_bascReqHandle[discIdx] = writeReqParam.handleValPair.attrHandle;
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_BASC_GetCharacteristicDescriptor
***************************************************************************//**
*
*  Sends a request to get a characteristic descriptor of the specified Battery Service
*  characteristic from the Server device. This function call can result in
*  generation of the following events based on a response from the Server
*  device:
*  * CY_BLE_EVT_BASC_READ_DESCR_RESPONSE
*  * CY_BLE_EVT_GATTC_ERROR_RSP
*
*  \param connHandle: The BLE peer device connection handle.
*  \param serviceIndex: The index of the service instance. e.g. If two Battery Services are
*                 supported in your design, then the first service will be identified
*                 by serviceIndex of 0 and the second - by serviceIndex of 1.
*  \param charIndex: The index of a Battery Service characteristic of type
*              cy_en_ble_bas_char_index_t.
*  \param descrIndex: The index of a Battery Service characteristic descriptor of type
*               cy_en_ble_bas_descr_index_t.
*
* \return
*  * CY_BLE_SUCCESS - The request was sent successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*  * CY_BLE_ERROR_INVALID_STATE - The state is not valid.
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*  * CY_BLE_ERROR_INVALID_OPERATION - This operation is not permitted on
*                                     the specified attribute.
*
* \events
*  If execution is successful (return value = CY_BLE_SUCCESS),
*  these events can appear: \n
*  If a BAS service-specific callback is registered
*      (with Cy_BLE_BAS_RegisterAttrCallback):
*  * CY_BLE_EVT_BASC_READ_DESCR_RESPONSE - if the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index, descr index, value, etc.)
*                                are provided with an event parameter structure
*                                of type cy_stc_ble_bas_descr_value_t.
*  .
*  Otherwise (if a BAS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_READ_RSP - if the requested attribute is
*                                successfully read on the peer device,
*                                the details (handle, value, etc.) are
*                                provided with the event parameters
*                                structure (cy_stc_ble_gattc_read_rsp_param_t).
*  * CY_BLE_EVT_GATTC_ERROR_RSP - if there is trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with the event parameters
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BASC_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               uint8_t serviceIndex,
                                                               cy_en_ble_bas_char_index_t charIndex,
                                                               cy_en_ble_bas_descr_index_t descrIndex)
{
    cy_en_ble_api_result_t apiResult;
    cy_stc_ble_gattc_read_req_t readReqParam = { .connHandle = connHandle };
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((serviceIndex >= CY_BLE_BASC_SERVICE_COUNT) || (charIndex > CY_BLE_BAS_BATTERY_LEVEL) ||
            (descrIndex >= CY_BLE_BAS_DESCR_COUNT) || (discIdx >= CY_BLE_CONFIG_GATTC_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        if(descrIndex == CY_BLE_BAS_BATTERY_LEVEL_CCCD)
        {
            readReqParam.attrHandle = cy_ble_basc[discIdx][serviceIndex].cccdHandle;
        }
        else /* CY_BLE_BAS_BATTERY_LEVEL_CPFD */
        {
            readReqParam.attrHandle = cy_ble_basc[discIdx][serviceIndex].cpfdHandle;
        }

        apiResult = Cy_BLE_GATTC_ReadCharacteristicDescriptors(&readReqParam);

        /* Save the handle to support a service-specific Read response from the device */
        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_bascReqHandle[discIdx] = readReqParam.attrHandle;
        }
    }

    return(apiResult);
}


