ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bas.c
/******************************************************************************
* Function Name: Cy_BLE_BASC_NotificationEventHandler
***************************************************************************//**
*
*  Handles a Notification event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_BASC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);
    uint32_t i;

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_BAS_ApplCallback != NULL))
    {
        for(i = 0u; i < CY_BLE_BASC_SERVICE_COUNT; i++)
        {
            if(cy_ble_basc[discIdx][i].batteryLevel.valueHandle == eventParam->handleValPair.attrHandle)
            {
                cy_stc_ble_bas_char_value_t locCharValue =
                {
                    .serviceIndex = (uint8_t)i,
                    .connHandle   = eventParam->connHandle,
                    .charIndex    = CY_BLE_BAS_BATTERY_LEVEL,
                    .value        = &eventParam->handleValPair.value,
                };
                Cy_BLE_BAS_ApplCallback((uint32_t)CY_BLE_EVT_BASC_NOTIFICATION, &locCharValue);
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                break;
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BASC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles a Read Response event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_BASC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);
    uint32_t locServIndex;
    uint32_t locReqHandle = 0u;

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_BAS_ApplCallback != NULL) &&
       (cy_ble_bascReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        for(locServIndex = 0u; (locServIndex < CY_BLE_BASC_SERVICE_COUNT) && (locReqHandle == 0u); locServIndex++)
        {
            if(cy_ble_basc[discIdx][locServIndex].batteryLevel.valueHandle == cy_ble_bascReqHandle[discIdx])
            {
                cy_stc_ble_bas_char_value_t batteryLevelValue =
                {
                    .connHandle   = eventParam->connHandle,
                    .serviceIndex = locServIndex,
                    .charIndex    = CY_BLE_BAS_BATTERY_LEVEL,
                    .value        = &eventParam->value
                };

                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                cy_ble_bascReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                Cy_BLE_BAS_ApplCallback((uint32_t)CY_BLE_EVT_BASC_READ_CHAR_RESPONSE, &batteryLevelValue);
                locReqHandle = 1u;
            }
            else if((cy_ble_basc[discIdx][locServIndex].cccdHandle == cy_ble_bascReqHandle[discIdx]) ||
                    (cy_ble_basc[discIdx][locServIndex].cpfdHandle == cy_ble_bascReqHandle[discIdx]))
            {
                cy_stc_ble_bas_descr_value_t locDescrValue =
                {
                    .connHandle   = eventParam->connHandle,
                    .serviceIndex = locServIndex,
                    .charIndex    = CY_BLE_BAS_BATTERY_LEVEL,
                    .descrIndex   = ((cy_ble_basc[discIdx][locServIndex].cccdHandle == cy_ble_bascReqHandle[discIdx]) ?
                                     CY_BLE_BAS_BATTERY_LEVEL_CCCD : CY_BLE_BAS_BATTERY_LEVEL_CPFD),
                    .value        = &eventParam->value
                };

                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                cy_ble_bascReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                Cy_BLE_BAS_ApplCallback((uint32_t)CY_BLE_EVT_BASC_READ_DESCR_RESPONSE, &locDescrValue);
                locReqHandle = 1u;
            }
            else /* Unsupported event code */
            {
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BASC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles a Write Response event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_BASC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);
    uint32_t locServIndex;

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_BAS_ApplCallback != NULL) &&
       (cy_ble_bascReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        for(locServIndex = 0u; locServIndex < (uint32_t)CY_BLE_BASC_SERVICE_COUNT; locServIndex++)
        {
            if(cy_ble_basc[discIdx][locServIndex].cccdHandle == cy_ble_bascReqHandle[discIdx])
            {
                cy_stc_ble_bas_descr_value_t locDescIndex =
                {
                    .connHandle   = *eventParam,
                    .serviceIndex = locServIndex,
                    .charIndex    = CY_BLE_BAS_BATTERY_LEVEL,
                    .descrIndex   = CY_BLE_BAS_BATTERY_LEVEL_CCCD,
                    .value        = NULL
                };

                cy_ble_bascReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_BAS_ApplCallback((uint32_t)CY_BLE_EVT_BASC_WRITE_DESCR_RESPONSE, &locDescIndex);
                break;
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BASC_ErrorResponseEventHandler
***************************************************************************//**
*
*  Handles an Error Response event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  None
*
******************************************************************************/
static void Cy_BLE_BASC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam)
{
    if(eventParam != NULL)
    {
        if(cy_ble_bascReqHandle[Cy_BLE_GetDiscoveryIdx(eventParam->connHandle)] == eventParam->errInfo.attrHandle)
        {
            cy_ble_bascReqHandle[Cy_BLE_GetDiscoveryIdx(eventParam->connHandle)] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}

#endif /* (CY_BLE_BAS_CLIENT) */


